app/controllers/autoriz_controller.rb

SELECT * FROM `autorizations` WHERE (`autorizations`.`id` = 5)
---
  def autoriz

    @autorization= Autorization.new()

    if request.post?

      @user=Autorization.find(params[:autorization][:id])