app/controllers/buhgalter_controller.rb

  def clients
    @allclients= Client.all
---
SELECT * FROM `clients`

  def orders
    @allclients= Client.all
---
SELECT * FROM `clients`

  def providers
    @allproviders= Provider.all
---
SELECT * FROM `providers`

  def purchases
    @allpurchases= Purchase.all
---
SELECT * FROM `purchases`