app/controllers/director_controller.rb

INSERT INTO `catalogs` (`name`, `updated_at`, `art`, `created_at`) VALUES('wee', '2010-05-11 13:32:39', 'кап', '2010-05-11 13:32:39')
---
def newcatalog
  @catalog = Catalog.new(params[:catalog])


  @description = Description.new(params[:description])

  #@description= Catalog.Description.new
  if request.post?
   # params[:description][:cost].gsub!(/,/, '.')


  if @catalog.save

SELECT * FROM `catalogs`
---
def cataloglook
  @allcatalog= Catalog.all

SELECT * FROM `descriptions` WHERE (dlina>= '1' and dlina<= '2' and cost>= '200' and cost<= '1800')
---
def catalogupdate

@catalog= Description.all

SELECT * FROM `catalogs` WHERE (`catalogs`.`id` = 46)
---
      if params[:upd][:name]!='' then
        if params[:upd][:art]!='' then
        #проверка наименования
          @f=Catalog.find(:all,:conditions => "name= '#{params[:upd][:name]}' and art='#{params[:upd][:art]}' ")

SELECT * FROM `orders`
SELECT * FROM `readies` WHERE (order_id= '1')
---
def infoorder
  @sostzak=[]
  @allorder=Order.all
  for ord in @allorder
    k=ord.id #считали id
    @sostzak[k]='готов'
    @r=Ready.find(:all,:conditions=> "order_id= '#{k}'") #нашли гп  заказа

SELECT * FROM `descriptions` WHERE (dlina>= '2' and shin='0')
SELECT * FROM `catalogs` WHERE (`catalogs`.`id` = 46)
---
def catalogdel

  k=0
  @catalog= Description.all

    if request.post?
      if params[:update_type][:type]=='all' then
        @catalog= Description.all
      else
        if params[:upd][:name]!='' then
        if params[:upd][:art]!='' then
        #проверка наименования
          @f=Catalog.find(:all,:conditions => "name= '#{params[:upd][:name]}' and art='#{params[:upd][:art]}' ")