app/controllers/manager_controller.rb

  def orders
    @allorders=Order.all
---
SELECT * FROM `orders` WHERE (asum= '212312323423')

  def clients
    @allclients= Client.all
---
SELECT * FROM `clients`