app/controllers/manager_controller.rb

  def orders
    @orders = Ready.all
---
SELECT * FROM `readies`

  def delorder
    @o=Order.all
    @c=Client.all

    if request.post?
      @k=params[:del].keys
      @v=params[:del].values
       for i in 0..@k.length-1
         if @v[i] == "1"
            id = @k[i].to_i
            @delit = Client.find(id)
---
SELECT * FROM `orders`
SELECT * FROM `clients`
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def neworder
    @order = Order.new(params[:order])
    @ready = Ready.new(params[:ready])
    #@desc = Description.new(params[:description])
    if request.post? then
      puts '##########'
      if @order.save then
---
INSERT INTO `orders` (`created_at`, `asum`, `updated_at`, `datastop`, `client_id`, `d_no`, `datago`) VALUES('2010-05-27 08:38:20', 123.0, '2010-05-27 08:38:20', '0027-09-09', 2, '1223', '0023-09-09')

  def delclient
    @allclients= Client.all
    if request.post?
      @k=params[:del].keys
      @v=params[:del].values
       for i in 0..@k.length-1
         if @v[i] == "1"
           id = @k[i].to_i
            @delit = Client.find(id)
            @delit.destroy
---
SELECT * FROM `clients`
SELECT * FROM `clients` WHERE (`clients`.`id` = 4)
DELETE FROM `clients` WHERE `id` = 4

  def updclient
    @allclients= Client.all
---
SELECT * FROM `clients`

  def update_one_client
    id=session[:id]
    @one=Client.find(id)
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 5)


      if @client.valid?
        @one.destroy
        @client.save
---
INSERT INTO `clients` (`cl_kpp`, `cl_adrfiz`, `cl_rs`, `created_at`, `cl_fio`, `updated_at`, `cl_adrur`, `cl_org`, `cl_bik`, `id`, `cl_tel`, `cl_ks`, `cl_bank`, `cl_inn`) VALUES('5009546540600', 'Washington, D.C.', '0549694545045', '2010-05-30 12:41:26', 'Geronds J. Albert', '2010-05-30 12:41:26', 'Washington, D.C.', 'Diamond', '4353453453058', 5, '12234445456', '3423443740748', 'NYBank', '3424556005066')

  def newclient
    @client = Client.new(params[:client])

        if request.post? then
          puts '#########'
          if @client.save then
---
INSERT INTO `clients` (`cl_kpp`, `cl_adrfiz`, `cl_rs`, `created_at`, `cl_fio`, `updated_at`, `cl_adrur`, `cl_org`, `cl_bik`, `cl_tel`, `cl_ks`, `cl_bank`, `cl_inn`) VALUES('457265472645723', 'ул.Вавилова', '239813127321736', '2010-05-27 02:26:51', 'Сидоров А.А.', '2010-05-27 02:26:51', 'Ул. Вавилова', 'Сбербанк', '123121312312322', '493838892', '123536156261177', 'Сбер', '267354676237294')

  def newprovider
    @provider = Provider.new(params[:provider])

                if request.post? then
                  if @provider.save then
---
INSERT INTO `providers` (`p_tel`, `created_at`, `p_adrfiz`, `p_ks`, `updated_at`, `p_inn`, `p_bank`, `p_kpp`, `p_fio`, `p_adrur`, `p_rs`, `p_org`, `p_bik`) VALUES('fsdfsdfdsds', '2010-05-30 13:26:30', 'sdfsdfsfsdfsd', 'fsdfsdfsdfsd', '2010-05-30 13:26:30', 'dsfsdfsfsdf', 'sdfsfsfssfsfs', 'sdfsdfsdfsdf', 'sdfsdfsfsfs', 'dfsdfsdfsfsf', 'sdfsdfsdfsdfsd', 'sdsddfsdf', 'dsfsdfsfsddd')

  def delprovider
    @allproviders= Provider.all
    if request.post?
      @k=params[:del].keys
      @v=params[:del].values
       for i in 0..@k.length-1
         if @v[i] == "1"
           id = @k[i].to_i
            @delit = Provider.find(id)
            @delit.destroy
---
SELECT * FROM `providers`
SELECT * FROM `providers` WHERE (`providers`.`id` = 3)
DELETE FROM `providers` WHERE `id` = 3

  def updprovider
    @allproviders= Provider.all
---
SELECT * FROM `providers`

  def update_one_provider
    id=session[:id]
    @one=Provider.find(id)
---
SELECT * FROM `providers` WHERE (`providers`.`id` = 1)


      if @provider.valid?
        @one.destroy
        @provider.save
---
INSERT INTO `providers` (`p_tel`, `created_at`, `p_adrfiz`, `p_ks`, `updated_at`, `p_inn`, `p_bank`, `id`, `p_kpp`, `p_fio`, `p_adrur`, `p_rs`, `p_org`, `p_bik`) VALUES('123-89-90', '2010-05-30 13:59:36', 'ул. Тяпкина', '546464645645', '2010-05-30 13:59:36', '232423423424', 'Сбербанк', 1, '324234234234', 'Ляпкин Д.А.', 'ул. Тяпкина', '546565644645', 'Карниз2000', '546464645645')

  def newdelivery
    @PartsProvider = PartsProvider.new(params[:parts_provider])

                if request.post? then
                  if @PartsProvider.save then
---
INSERT INTO `parts_providers` (`created_at`, `cost`, `provider_id`, `art`, `updated_at`, `part_id`) VALUES('2010-05-30 20:25:52', 400.0, 2, 'арт12333', '2010-05-30 20:25:52', 1)

  def deldelivery
    @alldeliveries=Provider.all
    puts  "#########"
    if request.post?
      @k=params[:deldeliv].keys
      @v=params[:deldeliv].values
       for i in 0..@k.length-1
         if @v[i] == "1"
              id = @k[i].to_i
              @delit = PartsProvider.find(id)
              id2=@delit.provider_id
              @delit2= Provider.find(id2)
              @delit.destroy
---
SELECT * FROM `providers`
SELECT * FROM `parts_providers` WHERE (`parts_providers`.`id` = 6)
SELECT * FROM `providers` WHERE (`providers`.`id` = 2)
DELETE FROM `parts_providers` WHERE `id` = 6
DELETE FROM `providers` WHERE `id` = 2

  def delpurchase
    @allpurchases=Purchase.all
---
SELECT * FROM `purchases`

  def catalogs
    @allCatalog=Catalog.all
---
SELECT * FROM `catalogs`