app/controllers/manager_controller.rb

  def deldelivery
    @alldeliveries=PartsProvider.all
---
SELECT * FROM `parts_providers`