app/controllers/nachpr_controller.rb

SELECT * FROM `readies` WHERE (sost=1)
---
 def neworder
   @newready=Ready.find(:all,:conditions=>"sost=1")

SELECT * FROM `readies` WHERE (sost!=1)
---
 def noworder
   @sost=[]
   @newready=Ready.find(:all,:conditions=>"sost!=1")

INSERT INTO `parts_purchases` (`created_at`, `art`, `updated_at`, `purchase_id`, `kol`, `part_id`) VALUES('2010-05-30 23:48:29', 'ahn32', '2010-05-30 23:48:29', 1, 2, 1)
---
 def newreq #новая заявка на комплектующие

   @req = PartsPurchase.new(params[:parts_purchase])

                if request.post? then
                  if @req.save then

SELECT * FROM `readies` WHERE (`readies`.`id` = 1)
---
 def gpstatus
   if request.post? then
     session[:id]=params[:update_type][:type]
     id=session[:id]
      @r=Ready.find(id)